projects/geneAIe/src/app/views/documents/show.html.erb

SELECT 1 AS one FROM "document_fields" WHERE "document_fields"."document_id" = $1 LIMIT $2  [["document_id", 5], ["LIMIT", 1]]
---

    <% if @document.document_fields.any? %>