projects/geneAIe/src/app/views/concerns/index.html.erb

            <p class="card-text text-muted">
              <%= pluralize(concern.documents.count, 'document') %>
---
SELECT COUNT(*) FROM "documents" WHERE "documents"."concern_id" = $1  [["concern_id", 10]]