projects/geneAIe/src/app/views/concerns/show.html.erb

      <dt class="col-sm-3">Documents</dt>
      <dd class="col-sm-9"><%= pluralize(@concern.documents.count, 'document') %></dd>
---
SELECT COUNT(*) FROM "documents" WHERE "documents"."concern_id" = $1  [["concern_id", 16]]