projects/geneAIe/src/app/controllers/concerns_controller.rb

SELECT "concerns".* FROM "concerns" ORDER BY "concerns"."name" ASC
---
  def index
    @concerns = Concern.includes(:owner).order(:name)

SELECT "concerns".* FROM "concerns" WHERE "concerns"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]
---
  def show
    @concern = Concern.find(params[:id])

SELECT "concerns".* FROM "concerns" WHERE "concerns"."id" = $1 LIMIT $2  [["id", 13], ["LIMIT", 1]]
---
  def confirm
    @concern = Concern.find(params[:id])