projects/geneAIe/src/app/controllers/documents_controller.rb

  def index
    @documents = Document.includes(:concern, :owner).order(created_at: :desc)
---
SELECT "documents".* FROM "documents" ORDER BY "documents"."created_at" DESC

  def show
    @document = Document.includes(:concern, :document_fields).find(params[:id])
---
SELECT "documents".* FROM "documents" WHERE "documents"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]